GPU.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-03 Sun 17:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gpu</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/white.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gpu</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2df9803">1. Tensorflow use GPU</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2df9803" class="outline-2">
<h2 id="org2df9803"><span class="section-number-2">1.</span> Tensorflow use GPU</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">import</span> tensorflow <span style="color: #51afef;">as</span> tf
<span class="linenr"> 2: </span><span style="color: #51afef;">import</span> time
<span class="linenr"> 3: </span><span style="color: #51afef;">def</span> <span style="color: #c678dd;">time_matmul</span>(x):
<span class="linenr"> 4: </span>    <span style="color: #dcaeea;">start</span> = time.time()
<span class="linenr"> 5: </span>    <span style="color: #51afef;">for</span> loop <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">10</span>):
<span class="linenr"> 6: </span>        tf.matmul(x, x)
<span class="linenr"> 7: </span>        <span style="color: #dcaeea;">result</span> = time.time()-start
<span class="linenr"> 8: </span>        <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"10 loops: {:0.2f}ms"</span>.<span style="color: #c678dd;">format</span>(<span style="color: #da8548; font-weight: bold;">1000</span>*result))
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Force execution on CPU print("On CPU:")</span>
<span class="linenr">11: </span><span style="color: #51afef;">with</span> tf.device(<span style="color: #98be65;">"CPU:0"</span>):
<span class="linenr">12: </span>    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"On CPU:"</span>)
<span class="linenr">13: </span>    x = tf.random.uniform([<span style="color: #da8548; font-weight: bold;">1000</span>, <span style="color: #da8548; font-weight: bold;">1000</span>])
<span class="linenr">14: </span>    <span style="color: #51afef;">assert</span> x.device.endswith(<span style="color: #98be65;">"CPU:0"</span>)
<span class="linenr">15: </span>    time_matmul(x)
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Force execution on GPU #0 if available</span>
<span class="linenr">18: </span><span style="color: #51afef;">if</span> tf.test.is_gpu_available():
<span class="linenr">19: </span>    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"On GPU:"</span>)
<span class="linenr">20: </span>    <span style="color: #51afef;">with</span> tf.device(<span style="color: #98be65;">"GPU:0"</span>): <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Or GPU:1 for the 2nd GPU, GPU:2 for the 3rd etc.</span>
<span class="linenr">21: </span>        x = tf.random.uniform([<span style="color: #da8548; font-weight: bold;">1000</span>, <span style="color: #da8548; font-weight: bold;">1000</span>])
<span class="linenr">22: </span>        <span style="color: #51afef;">assert</span> x.device.endswith(<span style="color: #98be65;">"GPU:0"</span>)
<span class="linenr">23: </span>        time_matmul(x)
</pre>
</div>

<pre class="example" id="org8bbe953">
On CPU:
10 loops: 2.84ms
10 loops: 5.41ms
10 loops: 7.89ms
10 loops: 10.24ms
10 loops: 12.60ms
10 loops: 15.13ms
10 loops: 17.50ms
10 loops: 19.84ms
10 loops: 22.37ms
10 loops: 24.70ms
On GPU:
10 loops: 0.12ms
10 loops: 0.25ms
10 loops: 0.35ms
10 loops: 0.46ms
10 loops: 0.56ms
10 loops: 0.66ms
10 loops: 0.76ms
10 loops: 0.86ms
10 loops: 0.96ms
10 loops: 1.06ms
</pre>
<pre class="example" id="org4a921a2">
  *-display
       description: VGA compatible controller
       product: TU104GL [Quadro RTX 5000]
       vendor: NVIDIA Corporation
       physical id: 0
       bus info: pci@0000:37:00.0
       version: a1
       width: 64 bits
       clock: 33MHz
       capabilities: pm msi pciexpress vga_controller bus_master cap_list rom
       configuration: driver=nvidia latency=0
       resources: iomemory:cbf0-cbef iomemory:cbf0-cbef irq:137 memory:e3000000-e3ffffff memory:cbfe0000000-cbfefffffff memory:cbff0000000-cbff1ffffff ioport:6000(size=128) memory:e4080000-e40fffff
  *-display
       description: VGA compatible controller
       product: TU104GL [Quadro RTX 5000]
       vendor: NVIDIA Corporation
       physical id: 0
       bus info: pci@0000:86:00.0
       version: a1
       width: 64 bits
       clock: 33MHz
       capabilities: pm msi pciexpress vga_controller bus_master cap_list rom
       configuration: driver=nvidia latency=0
       resources: iomemory:d7f0-d7ef iomemory:d7f0-d7ef irq:138 memory:f0000000-f0ffffff memory:d7fe0000000-d7fefffffff memory:d7ff0000000-d7ff1ffffff ioport:a000(size=128) memory:f1080000-f10fffff

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung-Chin Yen</p>
<p class="date">Created: 2022-07-03 Sun 17:16</p>
</div>
</body>
</html>
